## plan for staging
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.api_container_definitions will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "api_container_definitions" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = jsonencode(
            [
+               {
+                   environment       = [
+                       {
+                           name  = "APP_DB_HOST"
+                           value = "${db_host}"
                        },
+                       {
+                           name  = "APP_DB_NAME"
+                           value = "${db_name}"
                        },
+                       {
+                           name  = "APP_DB_USERNAME"
+                           value = "${db_user}"
                        },
+                       {
+                           name  = "APP_DB_PASSWORD"
+                           value = "${db_pass}"
                        },
                    ]
+                   essential         = true
+                   image             = "${app_image}"
+                   logConfiguration  = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "${log_group_name}"
+                           awslogs-region        = "${log_group_region}"
+                           awslogs-stream-prefix = "api"
                        }
                    }
+                   memoryReservation = 256
+                   mountPoints       = [
+                       {
+                           containerPath = "/vol/web"
+                           readOnly      = false
+                           sourceVolume  = "static"
                        },
                    ]
+                   name              = "api"
+                   portMappings      = [
+                       {
+                           containerPort = 8080
+                           hostPort      = 8080
                        },
                    ]
                },
+               {
+                   environment       = [
+                       {
+                           name  = "APP_HOST"
+                           value = "127.0.0.1"
                        },
+                       {
+                           name  = "APP_PORT"
+                           value = "8080"
                        },
+                       {
+                           name  = "LISTEN_PORT"
+                           value = "8000"
                        },
                    ]
+                   essential         = true
+                   image             = "${proxy_image}"
+                   logConfiguration  = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "${log_group_name}"
+                           awslogs-region        = "${log_group_region}"
+                           awslogs-stream-prefix = "proxy"
                        }
                    }
+                   memoryReservation = 256
+                   mountPoints       = [
+                       {
+                           containerPath = "/vol/static"
+                           readOnly      = true
+                           sourceVolume  = "static"
                        },
                    ]
+                   name              = "proxy"
+                   portMappings      = [
+                       {
+                           containerPort = 8000
+                           hostPort      = 8000
                        },
                    ]
                },
            ]
        )
+       vars     = {
+           "app_image"        = "167259143853.dkr.ecr.eu-west-1.amazonaws.com/golang-mux-api:e6c1d2b"
+           "db_host"          = (known after apply)
+           "db_name"          = "demoecs"
+           "db_pass"          = (sensitive value)
+           "db_user"          = "demoecsapp"
+           "log_group_name"   = "demo-ecs-staging-api"
+           "log_group_region" = "eu-west-1"
+           "proxy_image"      = "167259143853.dkr.ecr.eu-west-1.amazonaws.com/golang-api-proxy:0f9f76f"
        }
    }

  # aws_cloudwatch_log_group.ecs_task_logs will be created
+   resource "aws_cloudwatch_log_group" "ecs_task_logs" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "demo-ecs-staging-api"
+       name_prefix       = (known after apply)
+       retention_in_days = 0
+       skip_destroy      = false
+       tags              = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all          = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
    }

  # aws_db_instance.main will be created
+   resource "aws_db_instance" "main" {
+       address                               = (known after apply)
+       allocated_storage                     = 20
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = 0
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_name                               = "demoecs"
+       db_subnet_group_name                  = "demo-ecs-staging-main"
+       delete_automated_backups              = true
+       endpoint                              = (known after apply)
+       engine                                = "postgres"
+       engine_version                        = "11.14"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "demo-ecs-staging-db"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t2.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       maintenance_window                    = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = false
+       name                                  = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       password                              = (sensitive value)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_throughput                    = (known after apply)
+       storage_type                          = "gp2"
+       tags                                  = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-main"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                              = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-main"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       timezone                              = (known after apply)
+       username                              = "demoecsapp"
+       vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.main will be created
+   resource "aws_db_subnet_group" "main" {
+       arn                     = (known after apply)
+       description             = "Managed by Terraform"
+       id                      = (known after apply)
+       name                    = "demo-ecs-staging-main"
+       name_prefix             = (known after apply)
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags                    = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-main"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-main"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
    }

  # aws_ecs_cluster.main will be created
+   resource "aws_ecs_cluster" "main" {
+       arn                = (known after apply)
+       capacity_providers = (known after apply)
+       id                 = (known after apply)
+       name               = "demo-ecs-staging-cluster"
+       tags               = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all           = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }

+       default_capacity_provider_strategy {
+           base              = (known after apply)
+           capacity_provider = (known after apply)
+           weight            = (known after apply)
        }

+       setting {
+           name  = (known after apply)
+           value = (known after apply)
        }
    }

  # aws_ecs_service.api will be created
+   resource "aws_ecs_service" "api" {
+       cluster                            = "demo-ecs-staging-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "demo-ecs-staging-api"
+       platform_version                   = "1.4.0"
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = "demo-ecs-staging-api"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "proxy"
+           container_port   = 8000
+           target_group_arn = (known after apply)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.api will be created
+   resource "aws_ecs_task_definition" "api" {
+       arn                      = (known after apply)
+       container_definitions    = (known after apply)
+       cpu                      = "256"
+       execution_role_arn       = (known after apply)
+       family                   = "demo-ecs-staging-api"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags                     = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                 = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       task_role_arn            = (known after apply)

+       volume {
+           name = "static"
        }
    }

  # aws_eip.public_a will be created
+   resource "aws_eip" "public_a" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc                  = true
    }

  # aws_eip.public_b will be created
+   resource "aws_eip" "public_b" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc                  = true
    }

  # aws_iam_instance_profile.bastion will be created
+   resource "aws_iam_instance_profile" "bastion" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "demo-ecs-staging-bastion-instance-profile"
+       path        = "/"
+       role        = "demo-ecs-staging-bastion"
+       tags_all    = (known after apply)
+       unique_id   = (known after apply)
    }

  # aws_iam_policy.task_execution_role_policy will be created
+   resource "aws_iam_policy" "task_execution_role_policy" {
+       arn         = (known after apply)
+       description = "Allow retrieving of images and adding to logs"
+       id          = (known after apply)
+       name        = "demo-ecs-staging-task-exec-role-policy"
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ecr:GetAuthorizationToken",
+                           "ecr:BatchCheckLayerAvailability",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:BatchGetImage",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # aws_iam_role.app_iam_role will be created
+   resource "aws_iam_role" "app_iam_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "demo-ecs-staging-api-task"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all              = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_iam_role.bastion will be created
+   resource "aws_iam_role" "bastion" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "demo-ecs-staging-bastion"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all              = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_iam_role.task_execution_role will be created
+   resource "aws_iam_role" "task_execution_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "demo-ecs-staging-task-exec-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all              = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.bastion_attach_policy will be created
+   resource "aws_iam_role_policy_attachment" "bastion_attach_policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = "demo-ecs-staging-bastion"
    }

  # aws_iam_role_policy_attachment.task_execution_role will be created
+   resource "aws_iam_role_policy_attachment" "task_execution_role" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "demo-ecs-staging-task-exec-role"
    }

  # aws_instance.bastion will be created
+   resource "aws_instance" "bastion" {
+       ami                                  = "ami-0fe0b2cf0e1f25c8a"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = "demo-ecs-staging-bastion-instance-profile"
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "golang-mux-api-devops-bastion"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-bastion"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-bastion"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "309b35916070e41021dd275e5fba2b9ef4bcbbfa"
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       maintenance_options {
+           auto_recovery = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.main will be created
+   resource "aws_internet_gateway" "main" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-main"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-main"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id   = (known after apply)
    }

  # aws_lb.api will be created
+   resource "aws_lb" "api" {
+       arn                        = (known after apply)
+       arn_suffix                 = (known after apply)
+       desync_mitigation_mode     = "defensive"
+       dns_name                   = (known after apply)
+       drop_invalid_header_fields = false
+       enable_deletion_protection = false
+       enable_http2               = true
+       enable_waf_fail_open       = false
+       id                         = (known after apply)
+       idle_timeout               = 60
+       internal                   = (known after apply)
+       ip_address_type            = (known after apply)
+       load_balancer_type         = "application"
+       name                       = "demo-ecs-staging-main"
+       preserve_host_header       = false
+       security_groups            = (known after apply)
+       subnets                    = (known after apply)
+       tags                       = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                   = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                     = (known after apply)
+       zone_id                    = (known after apply)

+       subnet_mapping {
+           allocation_id        = (known after apply)
+           ipv6_address         = (known after apply)
+           outpost_id           = (known after apply)
+           private_ipv4_address = (known after apply)
+           subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.api will be created
+   resource "aws_lb_listener" "api" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = (known after apply)

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.api will be created
+   resource "aws_lb_target_group" "api" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = false
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       name                               = "demo-ecs-staging-api"
+       port                               = 8000
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = (known after apply)
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check {
+           enabled             = true
+           healthy_threshold   = 3
+           interval            = 30
+           matcher             = (known after apply)
+           path                = "/api/healthcheck"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = (known after apply)
+           unhealthy_threshold = 3
        }

+       stickiness {
+           cookie_duration = (known after apply)
+           cookie_name     = (known after apply)
+           enabled         = (known after apply)
+           type            = (known after apply)
        }

+       target_failover {
+           on_deregistration = (known after apply)
+           on_unhealthy      = (known after apply)
        }
    }

  # aws_nat_gateway.public_a will be created
+   resource "aws_nat_gateway" "public_a" {
+       allocation_id        = (known after apply)
+       connectivity_type    = "public"
+       id                   = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip           = (known after apply)
+       public_ip            = (known after apply)
+       subnet_id            = (known after apply)
+       tags                 = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
    }

  # aws_nat_gateway.public_b will be created
+   resource "aws_nat_gateway" "public_b" {
+       allocation_id        = (known after apply)
+       connectivity_type    = "public"
+       id                   = (known after apply)
+       network_interface_id = (known after apply)
+       private_ip           = (known after apply)
+       public_ip            = (known after apply)
+       subnet_id            = (known after apply)
+       tags                 = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
    }

  # aws_route.private_a_internet_out will be created
+   resource "aws_route" "private_a_internet_out" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # aws_route.private_b_internet_out will be created
+   resource "aws_route" "private_b_internet_out" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # aws_route.public_internet_access_a will be created
+   resource "aws_route" "public_internet_access_a" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # aws_route.public_internet_access_b will be created
+   resource "aws_route" "public_internet_access_b" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # aws_route_table.private_a will be created
+   resource "aws_route_table" "private_a" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-private-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all         = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-private-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.private_b will be created
+   resource "aws_route_table" "private_b" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-private-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all         = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-private-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.public_a will be created
+   resource "aws_route_table" "public_a" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all         = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table.public_b will be created
+   resource "aws_route_table" "public_b" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all         = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.private_a will be created
+   resource "aws_route_table_association" "private_a" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_b will be created
+   resource "aws_route_table_association" "private_b" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_a will be created
+   resource "aws_route_table_association" "public_a" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_b will be created
+   resource "aws_route_table_association" "public_b" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_security_group.bastion will be created
+   resource "aws_security_group" "bastion" {
+       arn                    = (known after apply)
+       description            = "Control bastion inbound and outbound access"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
+           {
+               cidr_blocks      = [
+                   "10.1.10.0/24",
+                   "10.1.11.0/24",
                ]
+               description      = ""
+               from_port        = 5432
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 5432
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 22
            },
        ]
+       name                   = "demo-ecs-staging-bastion"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all               = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.ecs_service will be created
+   resource "aws_security_group" "ecs_service" {
+       arn                    = (known after apply)
+       description            = "Access for the ECS service"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "10.1.10.0/24",
+                   "10.1.11.0/24",
                ]
+               description      = ""
+               from_port        = 5432
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 5432
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               description      = ""
+               from_port        = 8000
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = 8000
            },
        ]
+       name                   = "demo-ecs-staging-ecs-service"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all               = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.lb will be created
+   resource "aws_security_group" "lb" {
+       arn                    = (known after apply)
+       description            = "Allow access to Application Load Balancer"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 8000
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 8000
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
        ]
+       name                   = "demo-ecs-staging-lb"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all               = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.rds will be created
+   resource "aws_security_group" "rds" {
+       arn                    = (known after apply)
+       description            = "Allow access to the RDS database instance"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = []
+               description      = ""
+               from_port        = 5432
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = (known after apply)
+               self             = false
+               to_port          = 5432
            },
        ]
+       name                   = "demo-ecs-staging-rds-inbound-access"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all               = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_subnet.private_a will be created
+   resource "aws_subnet" "private_a" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.10.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-private-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-private-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_b will be created
+   resource "aws_subnet" "private_b" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.11.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-private-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-private-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_a will be created
+   resource "aws_subnet" "public_a" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-a"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_b will be created
+   resource "aws_subnet" "public_b" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                                       = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-public-b"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.1.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-vpc"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                             = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-vpc"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
    }

Plan: 43 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   api_endpoint = (known after apply)
+   bastion_host = (known after apply)
+   db_host      = (known after apply)
```